ademch/ESP32MLX/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"
#include "MLX90640_API.h"

#include "SPIFFS.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
	#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
	#define CONFIG_LED_MAX_INTENSITY 255

	int led_duty = 0;
	bool isStreaming = false;
#endif

httpd_handle_t stream_httpd = NULL;
httpd_handle_t control_httpd = NULL;
httpd_handle_t mlxthc_httpd = NULL;

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_JPG_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";
static const char *_STREAM_BMP_PART = "Content-Type: image/bmp\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";


// ARDUHAL_LOG_LEVEL_NON-> ARDUHAL_LOG_LEVEL_ERROR -> ARDUHAL_LOG_LEVEL_WARN ->
// ARDUHAL_LOG_LEVEL_INFO -> ARDUHAL_LOG_LEVEL_DEBUG -> ARDUHAL_LOG_LEVEL_VERBOSE
//
// ARDUHAL_LOG_LEVEL is the current log level set for ESP32 project in Arduino
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO

	// running average number of samples
	#define ra_nSamples 20
	typedef struct {
		size_t index;  // next value index

		int sum;
		int values[ra_nSamples];
	} RunningAverage_t;

	static RunningAverage_t runningAverage = {};

	static int RunningAverage_run(RunningAverage_t *ra, int value)
	{
	  // remove overwritten value from the sum
	  ra->sum -= ra->values[ra->index];
	  // update the value
	  ra->values[ra->index] = value;
	  // add to the sum
	  ra->sum += ra->values[ra->index];
	  // move the pointer to the next value
	  ra->index++;
	  ra->index = ra->index % ra_nSamples;

	  return ra->sum / ra_nSamples;
	}
#endif

#if defined(LED_GPIO_NUM)
	// Turn LED On/Off
	void enable_led(bool en)
	{
		int duty = en ? led_duty : 0;
	
		if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
			duty = CONFIG_LED_MAX_INTENSITY;
	  	
		ledcWrite(LED_GPIO_NUM, duty);
	    //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
	    //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_esp_err_tED_LEDC_CHANNEL);
	    log_i("Set LED intensity to %d", duty);
	}
#endif

// GET /bmp
// Input: req- valid request
static esp_err_t bmp_handler(httpd_req_t *req)
{
  #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint64_t fr_start = esp_timer_get_time();
  #endif
  
  // lock spi memory dma buffer to read from
  camera_fb_t *fb = esp_camera_fb_get();
	  if (!fb)
	  {
		  log_e("Camera capture failed");
		  httpd_resp_send_500(req);
		  return ESP_FAIL;
	  }

	  // request has httpd_req_aux structure holding temporarily response details
	  httpd_resp_set_type(req, "image/x-windows-bmp");
	  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
	  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

	  char ts[32];
	  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
	  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

	  uint8_t *buf = NULL;
	  size_t buf_len = 0;
	  // calls fmt2bmp to convert camera supported types to BMP type (JPEG is supported)
	  // allocates buf internally
	  bool converted = frame2bmp(fb, &buf, &buf_len);
  
  // unlock spi dma buffer
  esp_camera_fb_return(fb);


  if (!converted)
  {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  // send response
  esp_err_t res = httpd_resp_send(req, (const char *)buf, buf_len);

  free(buf);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();
  log_i("BMP: %llu ms, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len); 
#endif

  return res;
}

// Callback function for jpeg stream output in capture_handler
static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
  jpg_chunking_t *j = (jpg_chunking_t *)arg;

  if (!index) j->len = 0;

  // send data as soon as available in chunks, headers are sent only during first call
  // First or next call is saved in req->aux->first_chunk_sent
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    return 0;

  j->len += len;

  return len;
}


// GET /capture
// Get image in JPEG format
//
// Input: req- valid request
static esp_err_t ov2640_capture_handler(httpd_req_t *req)
{
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

  log_i("/capture received");

#if defined(LED_GPIO_NUM)
  enable_led(true);
  // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
  // or it won't be visible in the frame. A better way to do this is needed.
  vTaskDelay(150 / portTICK_PERIOD_MS);  
  fb = esp_camera_fb_get();
  enable_led(false);
#else
  fb = esp_camera_fb_get();
#endif

  if (!fb)
  {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

