ademch/ESP32MLX/app_httpd.cpp
  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

  // httpd_query_key_value is a helper function to obtain a URL query tag from a query string
  // of the format param1=val1&param2=val2
  if (httpd_query_key_value(buf, "xclk", _xclk, sizeof(_xclk)) != ESP_OK)
  {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  free(buf);

  int xclk = atoi(_xclk);
  log_i("Set XCLK: %d MHz", xclk);

  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_xclk(s, LEDC_TIMER_0, xclk);
  
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  return httpd_resp_send(req, NULL, 0);
}

// GET /reg
static esp_err_t reg_handler(httpd_req_t *req)
{
  char _reg[32];
  char _mask[32];
  char _val[32];

  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

  // httpd_query_key_value is a helper function to obtain a URL query tag from a query string
  // of the format param1=val1&param2=val2
  if (httpd_query_key_value(buf, "reg",  _reg,  sizeof(_reg))  != ESP_OK ||
	  httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK ||
      httpd_query_key_value(buf, "val",  _val,  sizeof(_val))  != ESP_OK)
  {
      free(buf);
      httpd_resp_send_404(req);
      return ESP_FAIL;
  }
  free(buf);

  int reg = atoi(_reg);
  int mask = atoi(_mask);
  int val = atoi(_val);
  log_i("Set Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x", reg, mask, val);

  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_reg(s, reg, mask, val);
  
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  return httpd_resp_send(req, NULL, 0);
}

// GET /greg
// Get register handler
static esp_err_t greg_handler(httpd_req_t *req)
{
  char _reg[32];
  char _mask[32];

  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

  if (httpd_query_key_value(buf, "reg", _reg, sizeof(_reg)) != ESP_OK ||
	  httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK)
  {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  free(buf);

  int reg = atoi(_reg);
  int mask = atoi(_mask);

  sensor_t *s = esp_camera_sensor_get();

  int res = s->get_reg(s, reg, mask);
  if (res < 0) return httpd_resp_send_500(req);

  log_i("Get Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x", reg, mask, res);

  char buffer[20];
  const char *val = itoa(res, buffer, 10);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  return httpd_resp_send(req, val, strlen(val));
}

static int parse_get_var(char *buf, const char *key, int deflt)
{
  char _int[16];
  if (httpd_query_key_value(buf, key, _int, sizeof(_int)) != ESP_OK)
    return deflt;

  return atoi(_int);
}

static esp_err_t pll_handler(httpd_req_t *req)
{
  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK)
    return ESP_FAIL;

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul    = parse_get_var(buf, "mul", 0);
  int sys    = parse_get_var(buf, "sys", 0);
  int root   = parse_get_var(buf, "root", 0);
  int pre    = parse_get_var(buf, "pre", 0);
  int seld5  = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk   = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  return httpd_resp_send(req, NULL, 0);
}

// POST /uploadserver
static esp_err_t uploadserver_handler(httpd_req_t *req)
{
	char filepath[128] = "/index.html";  // target file
	File fd = SPIFFS.open(filepath, "w");
	if (!fd) {
		log_e("Failed to open file for writing");
		httpd_resp_send_500(req);
		return ESP_FAIL;
	}

	int remaining = req->content_len;
	log_i("Receiving file, size: %d", remaining);

	char buf[512];
	int iRetries = 0;
	while (remaining > 0) {
		int nRead = httpd_req_recv(req, buf, sizeof(buf) );
		if (nRead <= 0)
		{
			if (nRead == HTTPD_SOCK_ERR_TIMEOUT) {
				if (iRetries++ < 3) continue; // retry
			}

			log_e("Receive error");
			fd.close();
			httpd_resp_send_500(req);

			return ESP_FAIL;
		}

		fd.write((uint8_t *)buf, nRead);

		remaining -= nRead;
	}

	fd.close();

	log_i("File stored as %s", filepath);

    return httpd_resp_sendstr(req, "Upload successful");
}


// GET /resolution
static esp_err_t win_handler(httpd_req_t *req)
{
    char *buf = NULL;
    if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

	int startX = parse_get_var(buf, "sx", 0);
	int offsetX = parse_get_var(buf, "offx", 0);
	int offsetY = parse_get_var(buf, "offy", 0);
	int totalX = parse_get_var(buf, "tx", 0);
	int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
	int outputX = parse_get_var(buf, "ox", 0);
	int outputY = parse_get_var(buf, "oy", 0);

    free(buf);

    log_i("Set Window: Resolution: %d, Start: %d %d, End: %d %d, Output: %d %d",
	      startX, offsetX, offsetY, totalX, totalY, outputX, outputY);

    sensor_t *s = esp_camera_sensor_get();
    int res = s->set_res_raw(s,
	  					     startX, 0,			// startX encodes mode
						     0, 0,				// ignored
						     offsetX, offsetY,	// start column of a window described by mode (see ratio table in ov2640_ratio.h)
						     totalX, totalY,	// end column of a window described by mode (see ratio table in ov2640_ratio.h)
						     outputX, outputY,	// final resolution asked
						     false, false);		// ignored
 
    // internally calls
	// set_window(ov2640_sensor_mode_t)startX, offsetX, offsetY, totalX, totalY, outputX, outputY);

    if (res) return httpd_resp_send_500(req);

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    return httpd_resp_send(req, NULL, 0);
}

// GET /
static esp_err_t index_handler(httpd_req_t *req)
{
	httpd_resp_set_hdr(req, "Cache-Control", "no-store");

	// Open file from SPIFFS
	const char* path = "/index.html"; // default file
	File file = SPIFFS.open(path, "r");
	
