ademch/ESP32MLX/app_httpd.cpp
	// if file does not exist
	if (!file.available()) {
		log_e("Failed to open file %s, sending default index.html", path);
		file.close();
		return httpd_resp_send(req, (const char *)index_ov2640_html_gz, sizeof(index_ov2640_html_gz) - 1);
	}

	// if file corrupted
	if (file.size() < 100) {
		log_e("File %s is corrupted, sending default index.html", path);
		file.close();
		return httpd_resp_send(req, (const char *)index_ov2640_html_gz, sizeof(index_ov2640_html_gz) - 1);
	}

	log_i("GET / request received, sending index.html from SPIFFS");

	// Stream file in chunks to client
	char buf[512];
	while (file.available()) {
		size_t len = file.readBytes(buf, sizeof(buf));
		if (httpd_resp_send_chunk(req, buf, len) != ESP_OK) {
			file.close();
			return ESP_FAIL;
		}
	}

	file.close();

	// Send zero-length chunk to indicate end
	return httpd_resp_send_chunk(req, NULL, 0);
}

void startControlAndStreamServers()
{
	httpd_config_t config = HTTPD_DEFAULT_CONFIG();
	config.max_uri_handlers = 16;

	httpd_uri_t ctrl_index_uri = {
		.uri = "/",
		.method = HTTP_GET,
		.handler = index_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_status_uri = {
		.uri = "/status",
		.method = HTTP_GET,
		.handler = status_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_control_uri = {
		.uri = "/control",
		.method = HTTP_GET,
		.handler = control_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t capture2640_uri = {
		.uri = "/capture2640",
		.method = HTTP_GET,
		.handler = ov2640_capture_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t capture90640_uri = {
		.uri = "/capture90640",
		.method = HTTP_GET,
		.handler = mlx90640_capture_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_bmp_uri = {
		.uri = "/bmp",
		.method = HTTP_GET,
		.handler = bmp_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_xclk_uri = {
		.uri = "/xclk",
		.method = HTTP_GET,
		.handler = xclk_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_reg_uri = {
		.uri = "/reg",
		.method = HTTP_GET,
		.handler = reg_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_greg_uri = {
		.uri = "/greg",
		.method = HTTP_GET,
		.handler = greg_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
	#endif
	};

	httpd_uri_t ctrl_pll_uri = {
		.uri = "/pll",
		.method = HTTP_GET,
		.handler = pll_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_win_uri = {
		.uri = "/resolution",
		.method = HTTP_GET,
		.handler = win_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t ctrl_uploadserver_uri = {
		.uri = "/uploadserver",
		.method = HTTP_POST,
		.handler = uploadserver_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t stream2640_uri = {
		.uri = "/stream",
		.method = HTTP_GET,
		.handler = stream2640_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

	httpd_uri_t stream90640_uri = {
		.uri = "/stream",
		.method = HTTP_GET,
		.handler = stream90640_handler,
		.user_ctx = NULL
		#ifdef CONFIG_HTTPD_WS_SUPPORT
		,
		.is_websocket = true,
		.handle_ws_control_frames = false,
		.supported_subprotocol = NULL
		#endif
	};

    log_i("Starting web server on port: '%d'", config.server_port);
    if (httpd_start(&control_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(control_httpd, &ctrl_index_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_control_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_status_uri);
        httpd_register_uri_handler(control_httpd, &capture2640_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_bmp_uri);
    
        httpd_register_uri_handler(control_httpd, &ctrl_xclk_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_reg_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_greg_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_pll_uri);
        httpd_register_uri_handler(control_httpd, &ctrl_win_uri);

		httpd_register_uri_handler(control_httpd, &ctrl_uploadserver_uri);

		httpd_register_uri_handler(control_httpd, &capture90640_uri);
    }
    
    config.server_port += 1;
    config.ctrl_port   += 1;
    
    log_i("Starting ov2640 stream server on port: '%d'", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(stream_httpd, &stream2640_uri);
    }
    
    config.server_port += 1;
    config.ctrl_port   += 1;
    
    log_i("Starting mlx90640 stream server on port: '%d'", config.server_port);
    if (httpd_start(&mlxthc_httpd, &config) == ESP_OK)
    {
	    httpd_register_uri_handler(mlxthc_httpd, &stream90640_uri);
	}
}

void setupLedFlash()
{
	#if defined(LED_GPIO_NUM)
	    ledcAttach(LED_GPIO_NUM, 5000, 8);	// pin, freq, resolution 8bit
	#else
	    log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
	#endif
}
